#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
      + authentication_flow_binding_overrides {}
    }

  # module.keycloak_test.module.onestopauth.module.client_test-9-3-21-1486.keycloak_openid_client.this will be updated in-place
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "b657fb7c-27af-4694-af03-8c9d3594b41c"
        name                                     = "test-9-3-21-1486"
        # (16 unchanged attributes hidden)

      + authentication_flow_binding_overrides {}
    }

  # module.keycloak_test.module.onestopauth.module.client_test-9-341.keycloak_openid_client.this will be updated in-place
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "478882a1-fad5-4729-ad9c-ddc08233e52f"
        name                                     = "test-9-341"
        # (16 unchanged attributes hidden)

      + authentication_flow_binding_overrides {}
    }

  # module.keycloak_test.module.onestopauth.module.client_test-958.keycloak_openid_client.this will be updated in-place
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "4022d096-4bfa-4686-9170-5eb947c90e93"
        name                                     = "test-958"
        # (15 unchanged attributes hidden)

      + authentication_flow_binding_overrides {}
    }

  # module.keycloak_test.module.onestopauth.module.client_test-994.keycloak_openid_client.this will be updated in-place
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "8f377ddc-f1f7-4d99-8aea-4d49d6ebe189"
        name                                     = "test-994"
        # (16 unchanged attributes hidden)

      + authentication_flow_binding_overrides {}
    }

  # module.keycloak_test.module.onestopauth.module.client_test-email-notification-598.keycloak_openid_client.this will be updated in-place
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "7a9fb705-5cbf-44c6-8ed3-d78591da5fc2"
        name                                     = "test-email-notification-598"
        # (16 unchanged attributes hidden)

      + authentication_flow_binding_overrides {}
    }

  # module.keycloak_test.module.onestopauth.module.client_test-project-1-663.keycloak_openid_client.this will be updated in-place
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "524cf3b1-7cf4-40f4-b2b5-0bc2e5a6069f"
        name                                     = "test-project-1-663"
        # (15 unchanged attributes hidden)

      + authentication_flow_binding_overrides {}
    }

  # module.keycloak_test.module.onestopauth.module.client_test-project-1260.keycloak_openid_client.this will be updated in-place
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "1b3db1db-4db6-4e9d-bfbc-1e46299b9bd0"
        name                                     = "test-project-1260"
        # (15 unchanged attributes hidden)

      + authentication_flow_binding_overrides {}
    }

  # module.keycloak_test.module.onestopauth.module.client_test-project-2-664.keycloak_openid_client.this will be updated in-place
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "64148ad9-39a5-422a-a372-d743de9433ff"
        name                                     = "test-project-2-664"
        # (15 unchanged attributes hidden)

      + authentication_flow_binding_overrides {}
    }

  # module.keycloak_test.module.onestopauth.module.client_test-regression-1257.keycloak_openid_client.this will be updated in-place
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "544a45c3-3864-41b5-b797-07e298be3554"
        name                                     = "test-regression-1257"
        # (16 unchanged attributes hidden)

      + authentication_flow_binding_overrides {}
    }

  # module.keycloak_test.module.onestopauth.module.client_test-sept-21-2113.keycloak_openid_client.this will be updated in-place
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "9eca297c-7c3e-4562-827e-91c887e61248"
        name                                     = "test-sept-21-2113"
        # (16 unchanged attributes hidden)

      + authentication_flow_binding_overrides {}
    }

  # module.keycloak_test.module.onestopauth.module.client_testapp-20211012-1.keycloak_openid_client.this will be updated in-place
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "39f33c95-dd36-4288-b4ad-4447d88224b9"
        name                                     = "testapp-20211012-1"
        # (16 unchanged attributes hidden)

      + authentication_flow_binding_overrides {}
    }

  # module.keycloak_test.module.onestopauth.module.client_testclient-10.keycloak_openid_client.this will be updated in-place
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "63ac5a96-4e81-4e80-aba7-79a0ea055972"
        name                                     = "testclient-10"
        # (15 unchanged attributes hidden)

      + authentication_flow_binding_overrides {}
    }

  # module.keycloak_test.module.onestopauth.module.client_testing-for-v-1-199.keycloak_openid_client.this will be updated in-place
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "b96b533f-2b24-4c2b-85f6-812bb182a247"
        name                                     = "testing-for-v-1-199"
        # (15 unchanged attributes hidden)

      + authentication_flow_binding_overrides {}
    }

  # module.keycloak_test.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_openid_client.this will be updated in-place
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "ebea8df8-da8c-43f2-a4b1-e2b744ea9891"
        name                                     = "testprojectjunabcedfg-100"
        # (15 unchanged attributes hidden)

      + authentication_flow_binding_overrides {}
    }

  # module.keycloak_test.module.onestopauth.module.client_testprojectjunmin-222-67.keycloak_openid_client.this will be updated in-place
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "ed88203e-d8f9-4bcf-a672-ca768fabccae"
        name                                     = "testprojectjunmin-222-67"
        # (16 unchanged attributes hidden)

      + authentication_flow_binding_overrides {}
    }

  # module.keycloak_test.module.onestopauth.module.client_testprojectjunmin-2222-100.keycloak_openid_client.this will be updated in-place
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "1de45def-8d2a-4200-88be-6562ffe4edea"
        name                                     = "testprojectjunmin-2222-100"
        # (15 unchanged attributes hidden)

      + authentication_flow_binding_overrides {}
    }

  # module.keycloak_test.module.onestopauth.module.client_testprojectjunmin-2222-34.keycloak_openid_client.this will be updated in-place
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "796dfdb0-673c-4cd7-ba6d-74a5cfd4634c"
        name                                     = "testprojectjunmin-2222-34"
        # (15 unchanged attributes hidden)

      + authentication_flow_binding_overrides {}
    }

  # module.keycloak_test.module.onestopauth.module.client_usability-testing-09-22-2014.keycloak_openid_client.this will be updated in-place
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "e3e501b5-03d1-40ef-ad3e-c984f0214f7a"
        name                                     = "usability-testing-09-22-2014"
        # (16 unchanged attributes hidden)

      + authentication_flow_binding_overrides {}
    }

  # module.keycloak_test.module.onestopauth.module.client_ztest-134.keycloak_openid_client.this will be updated in-place
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "d27e8714-422d-476c-8e2a-47216062a4e0"
        name                                     = "ztest-134"
        # (15 unchanged attributes hidden)

      + authentication_flow_binding_overrides {}
    }

  # module.keycloak_test.module.onestopauth.module.client_zz-2873.keycloak_openid_client.this will be updated in-place
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "8b7ad500-4e86-4624-8678-dd0b10874748"
        name                                     = "zz-2873"
        # (15 unchanged attributes hidden)

      + authentication_flow_binding_overrides {}
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_a-2938.keycloak_openid_client.this will be updated in-place
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "34ebc3c1-beec-46dc-a7a0-85d4d1e1152b"
        name                                     = "a-2938"
        # (16 unchanged attributes hidden)

      + authentication_flow_binding_overrides {}
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_bceid-no-prod-3103.keycloak_openid_client.this will be updated in-place
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "5f494472-f842-42eb-aa3e-2a56f3f974e9"
        name                                     = "bceid-no-prod-3103"
        # (16 unchanged attributes hidden)

      + authentication_flow_binding_overrides {}
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_openid_client.this will be updated in-place
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "440bbfc7-eae5-48d0-9099-2d52576be2ce"
        name                                     = "bceid-test-2971"
        # (16 unchanged attributes hidden)

      + authentication_flow_binding_overrides {}
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_bceid-testzorin-2707.keycloak_openid_client.this will be updated in-place
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "1e2cafed-a9a2-421b-a1b7-45f4c4337205"
        name                                     = "bceid-testzorin-2707"
        # (15 unchanged attributes hidden)

      + authentication_flow_binding_overrides {}
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_nov-16-3204.keycloak_openid_client.this will be updated in-place
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "fb058d58-ab61-47e7-8241-bac9a0b6fbef"
        name                                     = "nov-16-3204"
        # (15 unchanged attributes hidden)

      + authentication_flow_binding_overrides {}
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_sdfa-3334.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "sdfa-3334"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_sdfa-3334.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_sdfa-3334.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_sdfa-3334.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_sdfa-3334.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "sdfa-3334"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_sdfa-3334.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_sdfa-3334.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_sdfa-3334.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "sdfa-3334"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "sdfa-3334"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://bcgov.github.io/sso-terraform-dev/request/2410",
        ]
      + web_origins                              = [
          + "+",
        ]

      + authentication_flow_binding_overrides {
          + browser_id = "null"
        }
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_test-3070.keycloak_openid_client.this will be updated in-place
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "a2bd074a-a724-4823-ab31-7eb9d4355ae1"
        name                                     = "test-3070"
        # (15 unchanged attributes hidden)

      + authentication_flow_binding_overrides {}
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_ztest-2-2810.keycloak_openid_client.this will be updated in-place
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "78bc6d6f-8141-4725-ad4a-3f30c6cbffc8"
        name                                     = "ztest-2-2810"
        # (15 unchanged attributes hidden)

      + authentication_flow_binding_overrides {}
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_openid_client.this will be updated in-place
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "6abd0a6e-3153-4e43-8ee5-08d74855a284"
        name                                     = "zz-2806"
        # (15 unchanged attributes hidden)

      + authentication_flow_binding_overrides {}
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-2807.keycloak_openid_client.this will be updated in-place
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "6b9892db-86b3-4e93-a7e2-7cfaad4f8285"
        name                                     = "zz-2807"
        # (15 unchanged attributes hidden)

      + authentication_flow_binding_overrides {}
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-3037.keycloak_openid_client.this will be updated in-place
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "70d40b37-1a4a-4913-a134-22ac41a34224"
        name                                     = "zz-3037"
        # (15 unchanged attributes hidden)

      + authentication_flow_binding_overrides {}
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-3137.keycloak_openid_client.this will be updated in-place
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "bbf653e0-f217-437e-a887-ea4b33d0dd08"
        name                                     = "zz-3137"
        # (15 unchanged attributes hidden)

      + authentication_flow_binding_overrides {}
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-3169.keycloak_openid_client.this will be updated in-place
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "0fd6e2c3-192d-4b4b-84f6-e89e7782e781"
        name                                     = "zz-3169"
        # (15 unchanged attributes hidden)

      + authentication_flow_binding_overrides {}
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-3268.keycloak_openid_client.this will be updated in-place
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "2983962b-7c3f-4d3a-ad30-c96720281384"
        name                                     = "zz-3268"
        # (15 unchanged attributes hidden)

      + authentication_flow_binding_overrides {}
    }

  # module.keycloak_test.module.onestopauth_both.module.client_test-2641.keycloak_openid_client.this will be updated in-place
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "eff545e3-8eb2-4416-bf0c-f849ee9ec050"
        name                                     = "test-2641"
        # (16 unchanged attributes hidden)

      + authentication_flow_binding_overrides {}
    }

Plan: 16 to add, 383 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 3080 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*